MatrixSeven/esp32-wol-online/src/main.cpp
/*
 * ESP32-S3 Wake-on-LAN 唤醒器 v3.0
 * 支持多设备管理、局域网扫描、HTTP API
 * 外网访问: WebSocket 客户端连接公网服务器
 */

#include <WiFi.h>
#include <WiFiUdp.h>
#include <WebServer.h>
#include <Preferences.h>
#include <ESPmDNS.h>
#include <ArduinoJson.h>
#include <ArduinoWebsockets.h>
#include <ESP32Ping.h>
#include <lwip/etharp.h>
#include <lwip/netif.h>
#include "config.h"
#include "web_server.h"

using namespace websockets;

WebServer server(WEB_SERVER_PORT);
WiFiUDP udp;
Preferences preferences;
WebsocketsClient *wsClient = nullptr;

volatile bool buttonPressed = false;
unsigned long lastButtonTime = 0;
bool ledState = false;
unsigned long lastLedToggle = 0;
unsigned long lastWsReconnect = 0;
unsigned long lastWsHeartbeat = 0;
bool wsConnecting = false;
unsigned int wakeCount = 0;

// ==================== 函数声明 ====================
void loadDevices();
void saveDevices();
void loadSettings();
void saveSettings();
void connectWiFi();
void sendWOL(uint8_t *mac);
void flashLED(int times);
void updateLED();
void printDeviceList();
bool checkAuth();
bool getMacFromARP(IPAddress ip, uint8_t *mac);
void startNetworkScan();
String generateDeviceList();
void IRAM_ATTR buttonISR();
void initWebSocket();
void connectWebSocket();
void handleWebSocket();
void onWsMessage(WebsocketsMessage message);
void sendWsResponse(String requestId, bool success, const char* message, JsonDocument* data = nullptr);
String handleWsCommand(JsonDocument& doc);
void updateWsStatus();

// ==================== Setup ====================
void setup() {
  Serial.begin(115200);
  delay(1000);
  Serial.println("\n=================================");
  Serial.println("  ESP32-S3 WOL 唤醒器 v3.0");
  Serial.println("=================================\n");

  pinMode(BUTTON_PIN, INPUT_PULLUP);
  pinMode(LED_PIN, OUTPUT);
  digitalWrite(LED_PIN, LOW);

  loadSettings();
  loadDevices();
  if (deviceCount == 0) initDefaultDevices();

  connectWiFi();

  // WiFi 连接成功后再初始化 WebSocket
  if (WS_ENABLED && WiFi.status() == WL_CONNECTED) {
    delay(1000);  // 等待网络栈完全就绪
    initWebSocket();
  }

  if (!MDNS.begin("esp32-wol")) {
    Serial.println("mDNS 启动失败");
  } else {
    Serial.println("mDNS: esp32-wol.local");
  }

  // Web 路由
  server.on("/", []() {
    String html = INDEX_HTML;
    html.replace("%IP_ADDR%", WiFi.localIP().toString());
    html.replace("%DEVICE_LIST%", generateDeviceList());
    server.send(200, "text/html", html);
  });

  server.on("/wake", []() {
    if (!checkAuth()) return;
    String all = server.arg("all");
    String idxStr = server.arg("index");

    if (all == "1") {
      // 唤醒所有已保存设备
      for (int i = 0; i < deviceCount; i++) { sendWOL(devices[i].mac); delay(50); }
      server.send(200, "application/json", "{\"success\":true,\"device\":\"所有设备\"}");
    } else if (idxStr != "") {
      int idx = idxStr.toInt();
      if (idx >= 0 && idx < deviceCount) {
        sendWOL(devices[idx].mac);
        server.send(200, "application/json", "{\"success\":true,\"device\":\"" + devices[idx].name + "\"}");
      } else {
        server.send(200, "application/json", "{\"success\":false,\"message\":\"无效索引\"}");
      }
    } else {
      server.send(200, "application/json", "{\"success\":false,\"message\":\"缺少参数\"}");
    }
  });

  // 广播唤醒 - 向整个局域网广播发送 WOL
  server.on("/wake/broadcast", []() {
    if (!checkAuth()) return;

    Serial.println("\n========================================");
    Serial.println("广播唤醒: 向整个局域网发送 WOL 包");
    Serial.println("========================================");

    IPAddress broadcastIP(255, 255, 255, 255);
    IPAddress subnetBroadcast = WiFi.localIP();
    subnetBroadcast[3] = 255;

    int sentCount = 0;

    // 1. 首先唤醒所有已保存的设备
    Serial.println("步骤1: 唤醒已保存设备列表...");
    for (int i = 0; i < deviceCount; i++) {
      sendWOL(devices[i].mac);
      sentCount++;
      delay(50);
      Serial.printf("  [%d] %s -> %s\n", i + 1, devices[i].name.c_str(), macToString(devices[i].mac).c_str());
    }

    // 2. 向广播地址发送通用 WOL 包 (多次)
    Serial.println("\n步骤2: 向广播地址发送通用唤醒包...");

    // 构造通用广播 WOL 包 - 使用子网广播 MAC
    uint8_t packet[102];
    for (int i = 0; i < 6; i++) packet[i] = 0xFF;
    for (int i = 1; i <= 16; i++)
      for (int j = 0; j < 6; j++)
        packet[i * 6 + j] = 0xFF;

    // 发送到多个广播地址
    for (int retry = 0; retry < 5; retry++) {
      // 发送到 255.255.255.255
      udp.beginPacket(broadcastIP, WOL_PORT);
      udp.write(packet, 102);
      udp.endPacket();

      // 发送到子网广播
      udp.beginPacket(subnetBroadcast, WOL_PORT);
      udp.write(packet, 102);
      udp.endPacket();

      delay(100);
      sentCount += 2;
    }

    // 3. 如果有扫描结果，也唤醒扫描到的设备
    if (scannedDeviceCount > 0) {
      Serial.println("\n步骤3: 唤醒扫描发现的设备...");
      for (int i = 0; i < scannedDeviceCount; i++) {
        // 跳过无效 MAC
        if (scannedDevices[i].mac[0] == 0 && scannedDevices[i].mac[1] == 0) continue;

        sendWOL(scannedDevices[i].mac);
        sentCount++;
        delay(30);
        Serial.printf("  [%d] %s\n", i + 1, scannedDevices[i].ip.toString().c_str());
      }
    }

    Serial.printf("\n广播唤醒完成! 共发送 %d 个 WOL 包\n", sentCount);
    Serial.println("========================================\n");

    String json = "{\"success\":true,\"message\":\"广播唤醒已发送\",\"count\":" + String(sentCount) + "}";
    server.send(200, "application/json", json);
  });

  server.on("/add", []() {
    if (!checkAuth()) return;
    String name = server.arg("name");
    String mac = server.arg("mac");

    if (name == "" || mac == "") {
      server.send(200, "application/json", "{\"success\":false,\"message\":\"参数不完整\"}");
      return;
    }
    if (deviceCount >= MAX_DEVICES) {
      server.send(200, "application/json", "{\"success\":false,\"message\":\"设备数量已达上限\"}");
      return;
    }

    devices[deviceCount].name = name;
    parseMac(mac, devices[deviceCount].mac);
    devices[deviceCount].enabled = true;
    deviceCount++;
    saveDevices();
    Serial.printf("添加设备: %s [%s]\n", name.c_str(), mac.c_str());
    server.send(200, "application/json", "{\"success\":true}");
  });

  server.on("/delete", []() {
    if (!checkAuth()) return;
    int idx = server.arg("index").toInt();

