MatrixSeven/esp32-wol-online/src/main.cpp
    if (idx < 0 || idx >= deviceCount) {
      server.send(200, "application/json", "{\"success\":false}");
      return;
    }

    Serial.printf("删除设备: %s\n", devices[idx].name.c_str());
    for (int i = idx; i < deviceCount - 1; i++) {
      devices[i] = devices[i + 1];
    }
    deviceCount--;
    saveDevices();
    server.send(200, "application/json", "{\"success\":true}");
  });

  server.on("/list", []() {
    String json = "{\"devices\":[";
    for (int i = 0; i < deviceCount; i++) {
      if (i > 0) json += ",";
      json += "{\"name\":\"" + devices[i].name + "\",\"mac\":\"" + macToString(devices[i].mac) + "\"}";
    }
    json += "]}";
    server.send(200, "application/json", json);
  });

  server.on("/scan", []() {
    if (isScanning) {
      server.send(200, "application/json", "{\"success\":false,\"message\":\"扫描进行中\"}");
      return;
    }
    server.send(200, "application/json", "{\"success\":true,\"message\":\"开始扫描\"}");
    delay(100);
    startNetworkScan();
  });

  server.on("/scan/results", []() {
    String json = "{\"scanning\":" + String(isScanning ? "true" : "false") +
                  ",\"progress\":" + String(scanProgress) + ",\"devices\":[";
    for (int i = 0; i < scannedDeviceCount; i++) {
      if (i > 0) json += ",";
      json += "{\"ip\":\"" + scannedDevices[i].ip.toString() +
              "\",\"mac\":\"" + macToString(scannedDevices[i].mac) + "\"" +
              ",\"name\":\"" + scannedDevices[i].hostname + "\"}";
    }
    json += "]}";
    server.send(200, "application/json", json);
  });

  server.on("/settings", []() {
    String json = "{\"ws_enabled\":" + String(WS_ENABLED ? "true" : "false") +
                  ",\"ws_server\":\"" + WS_SERVER + "\"" +
                  ",\"ws_user\":\"" + WS_USER + "\"" +
                  ",\"ws_connected\":" + String((wsClient && wsClient->available()) ? "true" : "false") +
                  ",\"remote_url\":\"" + REMOTE_URL + "\"}";
    server.send(200, "application/json", json);
  });

  server.on("/status", []() {
    // 读取芯片内部温度 (ESP32-S3)
    float tempC = temperatureRead();
    String json = "{\"uptime\":" + String(millis() / 1000) +
                  ",\"wake_count\":" + String(wakeCount) +
                  ",\"wifi_rssi\":" + String(WiFi.RSSI()) +
                  ",\"free_heap\":" + String(ESP.getFreeHeap()) +
                  ",\"temperature\":" + String(tempC, 1) +
                  ",\"ip\":\"" + WiFi.localIP().toString() + "\"" +
                  ",\"mac\":\"" + WiFi.macAddress() + "\"" +
                  ",\"ssid\":\"" + String(WIFI_SSID) + "\"" +
                  ",\"chip_model\":\"" + String(ESP.getChipModel()) + "\"" +
                  ",\"flash_size\":" + String(ESP.getFlashChipSize()) +
                  ",\"device_count\":" + String(deviceCount) +
                  ",\"sdk_version\":\"" + String(ESP.getSdkVersion()) + "\"}";
    server.send(200, "application/json", json);
  });

  server.on("/settings/save", HTTP_GET, []() {
    if (!checkAuth()) return;
    bool wsChanged = false;
    if (server.hasArg("ws_enabled")) {
      bool newEnabled = server.arg("ws_enabled") == "true";
      if (newEnabled != WS_ENABLED) wsChanged = true;
      WS_ENABLED = newEnabled;
    }
    if (server.hasArg("ws_server")) {
      if (WS_SERVER != server.arg("ws_server")) wsChanged = true;
      WS_SERVER = server.arg("ws_server");
    }
    if (server.hasArg("ws_user")) WS_USER = server.arg("ws_user");
    if (server.hasArg("ws_pass")) WS_PASS = server.arg("ws_pass");
    if (server.hasArg("ws_token")) WS_TOKEN = server.arg("ws_token");
    if (server.hasArg("remote_url")) REMOTE_URL = server.arg("remote_url");
    saveSettings();

    // WebSocket 配置变更时重新连接
    if (wsChanged) {
      if (wsClient && wsClient->available()) wsClient->close();
      if (WS_ENABLED && WiFi.status() == WL_CONNECTED) {
        delay(500);
        initWebSocket();
      }
    }

    server.send(200, "application/json", "{\"success\":true}");
  });

  // 静态资源处理
  server.on("/favicon.ico", []() { server.send(204); });
  server.on("/robots.txt", []() { server.send(204); });

  server.onNotFound([]() { server.send(404, "text/plain", "Not Found"); });

  server.begin();
  Serial.printf("Web 服务器: http://%s\n", WiFi.localIP().toString().c_str());

  attachInterrupt(digitalPinToInterrupt(BUTTON_PIN), buttonISR, FALLING);
  Serial.println("系统就绪! 按下 BOOT 按钮唤醒第一个设备\n");
  printDeviceList();
}

// ==================== Loop ====================
void loop() {
  server.handleClient();

  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("WiFi 断开，重连中...");
    connectWiFi();
  }

  // WebSocket 处理
  if (WS_ENABLED) {
    handleWebSocket();
  }

  if (buttonPressed) {
    buttonPressed = false;
    if (deviceCount > 0) {
      Serial.printf("按钮唤醒: %s\n", devices[0].name.c_str());
      sendWOL(devices[0].mac);
      flashLED(3);
    }
  }

  updateLED();
  delay(10);
}

// ==================== 中断 ====================
void IRAM_ATTR buttonISR() {
  if (millis() - lastButtonTime > DEBOUNCE_TIME) {
    buttonPressed = true;
    lastButtonTime = millis();
  }
}

// ==================== 认证 ====================
bool checkAuth() {
  if (!server.authenticate(AUTH_USERNAME, AUTH_PASSWORD)) {
    server.requestAuthentication();
    return false;
  }
  return true;
}

// ==================== WiFi ====================
void connectWiFi() {
  Serial.printf("连接 WiFi: %s\n", WIFI_SSID);
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  int attempts = 0;
  while (WiFi.status() != WL_CONNECTED && attempts < 20) {
    delay(500);
    Serial.print(".");
    attempts++;
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.printf("\nWiFi 连接成功! IP: %s\n", WiFi.localIP().toString().c_str());
  } else {
    Serial.println("\nWiFi 连接失败!");
  }
}

// ==================== WOL ====================
void sendWOL(uint8_t *mac) {
  uint8_t packet[102];
  for (int i = 0; i < 6; i++) packet[i] = 0xFF;
  for (int i = 1; i <= 16; i++)
    for (int j = 0; j < 6; j++)
      packet[i * 6 + j] = mac[j];

  IPAddress broadcastIP = WiFi.localIP();
  broadcastIP[3] = 255;

  udp.beginPacket(broadcastIP, WOL_PORT);
  udp.write(packet, 102);
  int result = udp.endPacket();

  if (result) wakeCount++;
  Serial.printf("WOL 发送%s: %s\n", result ? "成功" : "失败", macToString(mac).c_str());
}

