MatrixSeven/esp32-wol-online/src/main.cpp
// ==================== LED ====================
void flashLED(int times) {
  for (int i = 0; i < times; i++) {
    digitalWrite(LED_PIN, HIGH); delay(100);
    digitalWrite(LED_PIN, LOW); delay(100);
  }
}

void updateLED() {
  if (WiFi.status() == WL_CONNECTED) {
    if (!ledState) { ledState = true; digitalWrite(LED_PIN, HIGH); }
  } else {
    if (millis() - lastLedToggle > 500) {
      ledState = !ledState;
      digitalWrite(LED_PIN, ledState ? HIGH : LOW);
      lastLedToggle = millis();
    }
  }
}

// ==================== 存储 ====================
void loadSettings() {
  preferences.begin("settings", true);
  REMOTE_URL = preferences.getString("remote_url", "");
  WS_ENABLED = preferences.getBool("ws_enabled", false);
  WS_SERVER = preferences.getString("ws_server", "");
  WS_USER = preferences.getString("ws_user", "");
  WS_PASS = preferences.getString("ws_pass", "");
  WS_TOKEN = preferences.getString("ws_token", WS_TOKEN);
  preferences.end();
}

void saveSettings() {
  preferences.begin("settings", false);
  preferences.putString("remote_url", REMOTE_URL);
  preferences.putBool("ws_enabled", WS_ENABLED);
  preferences.putString("ws_server", WS_SERVER);
  preferences.putString("ws_user", WS_USER);
  preferences.putString("ws_pass", WS_PASS);
  preferences.putString("ws_token", WS_TOKEN);
  preferences.end();
  Serial.println("设置已保存");
}

void saveDevices() {
  preferences.begin("wol", false);
  preferences.putUInt("count", deviceCount);
  for (int i = 0; i < deviceCount; i++) {
    preferences.putString(("n" + String(i)).c_str(), devices[i].name);
    preferences.putString(("m" + String(i)).c_str(), macToString(devices[i].mac));
  }
  preferences.end();
  Serial.println("设备已保存");
}

void loadDevices() {
  preferences.begin("wol", true);
  deviceCount = preferences.getUInt("count", 0);
  for (int i = 0; i < deviceCount && i < MAX_DEVICES; i++) {
    devices[i].name = preferences.getString(("n" + String(i)).c_str(), "");
    String macStr = preferences.getString(("m" + String(i)).c_str(), "00:00:00:00:00:00");
    parseMac(macStr, devices[i].mac);
    devices[i].enabled = true;
  }
  preferences.end();
  Serial.printf("已加载 %d 个设备\n", deviceCount);
}

void printDeviceList() {
  Serial.println("--- 设备列表 ---");
  for (int i = 0; i < deviceCount; i++) {
    Serial.printf("%d. %s [%s]\n", i + 1, devices[i].name.c_str(), macToString(devices[i].mac).c_str());
  }
  Serial.println("----------------");
}

// ==================== ARP 扫描 ====================
bool getMacFromARP(IPAddress ip, uint8_t *mac) {
  struct netif *netif = netif_list;
  ip4_addr_t target_ip;
  target_ip.addr = ip;

  while (netif != NULL) {
    struct eth_addr *eth_ret = NULL;
    const ip4_addr_t *ip_ret = NULL;
    s8_t result = etharp_find_addr(netif, &target_ip, &eth_ret, &ip_ret);
    if (result >= 0 && eth_ret != NULL) {
      memcpy(mac, eth_ret->addr, 6);
      return true;
    }
    netif = netif->next;
  }
  return false;
}

// ==================== 扫描实时推送 ====================
void broadcastScanProgress(int progress, const char* status) {
  scanProgress = progress;
  Serial.printf("[%d%%] %s\n", progress, status);
}

void broadcastScanDevice(int index) {
  if (index < 0 || index >= scannedDeviceCount) return;
  Serial.printf(">> 发现: %s [%s] %s\n",
    scannedDevices[index].ip.toString().c_str(),
    macToString(scannedDevices[index].mac).c_str(),
    scannedDevices[index].hostname.length() > 0 ? ("(" + scannedDevices[index].hostname + ")").c_str() : ""
  );
}

// 添加设备到扫描结果（去重）
bool addScannedDevice(IPAddress ip, uint8_t *mac, const char* hostname) {
  if (scannedDeviceCount >= MAX_SCAN_RESULTS) return false;

  // 检查 MAC 是否已存在
  for (int i = 0; i < scannedDeviceCount; i++) {
    if (memcmp(scannedDevices[i].mac, mac, 6) == 0) {
      return false;  // 已存在
    }
  }

  scannedDevices[scannedDeviceCount].ip = ip;
  memcpy(scannedDevices[scannedDeviceCount].mac, mac, 6);
  scannedDevices[scannedDeviceCount].hostname = hostname;
  scannedDeviceCount++;

  broadcastScanDevice(scannedDeviceCount - 1);
  return true;
}

// 非阻塞处理：在扫描期间处理网络请求
void scanYield() {
  server.handleClient();
  if (WS_ENABLED && wsClient && wsClient->available()) {
    wsClient->poll();
  }
  delay(1);
}

// 推送扫描状态到 Go 服务器（通过 WebSocket）
// 分批发送，避免超出 WebSocket 缓冲区限制
void pushScanStatus() {
  if (!WS_ENABLED || !wsClient || !wsClient->available()) return;

  // 先发送状态（不含设备列表）
  JsonDocument statusDoc;
  statusDoc["cmd"] = "scan_status";
  statusDoc["data"]["scanning"] = isScanning;
  statusDoc["data"]["progress"] = scanProgress;
  statusDoc["data"]["total"] = scannedDeviceCount;

  String statusOut;
  serializeJson(statusDoc, statusOut);
  wsClient->send(statusOut);

  // 分批发送设备列表（每批 10 个设备）
  const int BATCH_SIZE = 10;
  for (int batch = 0; batch < scannedDeviceCount; batch += BATCH_SIZE) {
    JsonDocument doc;
    doc["cmd"] = "scan_devices_batch";
    doc["data"]["batch_start"] = batch;
    doc["data"]["total"] = scannedDeviceCount;

    JsonArray devices = doc["data"]["devices"].to<JsonArray>();
    int end = min(batch + BATCH_SIZE, scannedDeviceCount);
    for (int i = batch; i < end; i++) {
      JsonObject d = devices.add<JsonObject>();
      d["ip"] = scannedDevices[i].ip.toString();
      d["mac"] = macToString(scannedDevices[i].mac);
      d["name"] = scannedDevices[i].hostname;
    }

    String batchOut;
    serializeJson(doc, batchOut);
    wsClient->send(batchOut);
    delay(10);  // 短暂延迟，避免缓冲区溢出
  }
}

// ==================== 多轮 ARP 扫描（整合去重）====================
void startNetworkScan() {
  scannedDeviceCount = 0;
  isScanning = true;
  scanProgress = 0;

  IPAddress localIP = WiFi.localIP();

  Serial.println("\n========================================");
  Serial.println("多轮 ARP 扫描（3轮整合）");
  Serial.printf("子网: %d.%d.%d.0/24\n", localIP[0], localIP[1], localIP[2]);
  Serial.println("========================================\n");

  // 全局临时存储（避免栈溢出）
  static struct {
    uint8_t mac[6];
    int count;
    bool hasMac;
  } tempScanData[256];

