MatrixSeven/esp32-wol-online/src/main.cpp
  // 初始化
  for (int i = 0; i < 256; i++) {
    memset(tempScanData[i].mac, 0, 6);
    tempScanData[i].count = 0;
    tempScanData[i].hasMac = false;
  }

  // ========================================
  // 3 轮 ARP 扫描 (0-60%)
  // ========================================
  for (int round = 0; round < 3; round++) {
    Serial.printf("\n[轮次 %d/3] ARP 扫描...\n", round + 1);

    // 发送 ARP 请求
    for (int i = 1; i < 255; i++) {
      IPAddress targetIP(localIP[0], localIP[1], localIP[2], i);
      if (targetIP == localIP) continue;

      ip4_addr_t target_ip;
      target_ip.addr = targetIP;
      etharp_request(netif_default, &target_ip);

      if (i % 20 == 0) scanYield();
    }

    // 更新进度
    scanProgress = round * 15 + 5;
    char status[32];
    snprintf(status, sizeof(status), "ARP 轮次 %d/3", round + 1);
    broadcastScanProgress(scanProgress, status);
    pushScanStatus();

    // 等待响应
    for (int w = 0; w < 10; w++) {  // 1秒
      delay(100);
      scanYield();
    }

    // 读取 ARP 表并累计
    int roundFound = 0;
    for (int i = 1; i < 255; i++) {
      if (i == localIP[3]) continue;

      IPAddress targetIP(localIP[0], localIP[1], localIP[2], i);
      uint8_t mac[6];
      if (getMacFromARP(targetIP, mac)) {
        tempScanData[i].count++;

        // 保存 MAC（首次发现）
        if (!tempScanData[i].hasMac) {
          memcpy(tempScanData[i].mac, mac, 6);
          tempScanData[i].hasMac = true;
          roundFound++;
        }
      }

      if (i % 50 == 0) scanYield();
    }

    scanProgress = (round + 1) * 20;
    snprintf(status, sizeof(status), "轮次 %d 完成", round + 1);
    broadcastScanProgress(scanProgress, status);
    pushScanStatus();

    Serial.printf("轮次 %d: 发现 %d 个响应\n", round + 1, roundFound);
  }

  // ========================================
  // 整合结果：所有发现过的设备 (60-70%)
  // ========================================
  Serial.println("\n[整合] 汇总所有发现的设备...");
  scanProgress = 60;
  broadcastScanProgress(60, "整合结果...");
  pushScanStatus();

  int totalCount = 0;
  for (int i = 1; i < 255 && scannedDeviceCount < MAX_SCAN_RESULTS; i++) {
    // 跳过本机 IP
    if (i == localIP[3]) continue;

    // 保留所有发现过的设备（出现 >= 1 次）
    if (tempScanData[i].count >= 1 && tempScanData[i].hasMac) {
      scannedDevices[scannedDeviceCount].ip = IPAddress(localIP[0], localIP[1], localIP[2], i);
      memcpy(scannedDevices[scannedDeviceCount].mac, tempScanData[i].mac, 6);
      scannedDevices[scannedDeviceCount].hostname = "";
      scannedDeviceCount++;
      totalCount++;

      Serial.printf("  [%d] %d.%d.%d.%d -> %s (出现 %d 次)\n",
        totalCount,
        localIP[0], localIP[1], localIP[2], i,
        macToString(tempScanData[i].mac).c_str(),
        tempScanData[i].count);
    }
  }

  Serial.printf("发现设备: %d 个\n", totalCount);

  // ========================================
  // 设备名称识别 (70-100%)
  // ========================================
  if (scannedDeviceCount > 0) {
    Serial.println("\n[识别] 查询设备名称...");
    scanProgress = 70;
    broadcastScanProgress(70, "mDNS 查询...");
    pushScanStatus();

    // 批量 mDNS
    int mdnsCount = MDNS.queryService("_workstation._tcp", "local");
    int mdnsMatched = 0;

    for (int i = 0; i < scannedDeviceCount; i++) {
      for (int j = 0; j < mdnsCount; j++) {
        if (MDNS.IP(j) == scannedDevices[i].ip) {
          scannedDevices[i].hostname = MDNS.hostname(j);
          mdnsMatched++;
          break;
        }
      }
      if (i % 10 == 0) scanYield();
    }

    Serial.printf("mDNS: 识别 %d 个设备名称\n", mdnsMatched);
  }

  // ========================================
  // 完成
  // ========================================
  isScanning = false;
  scanProgress = 100;
  broadcastScanProgress(100, "扫描完成");
  pushScanStatus();

  int namedCount = 0;
  for (int i = 0; i < scannedDeviceCount; i++) {
    if (scannedDevices[i].hostname.length() > 0) namedCount++;
  }

  Serial.println("\n========================================");
  Serial.printf("扫描完成! 共 %d 设备, %d 个已命名\n", scannedDeviceCount, namedCount);
  Serial.println("========================================\n");
}

// ==================== 生成设备列表 HTML ====================
String generateDeviceList() {
  if (deviceCount == 0) {
    return "<li class='empty-state'>暂无设备，点击下方添加</li>";
  }

  String list = "";
  for (int i = 0; i < deviceCount; i++) {
    list += "<li class='device-item'>";
    list += "<div class='device-info'>";
    list += "<div class='device-name'>" + devices[i].name + "</div>";
    list += "<div class='device-mac'>" + macToString(devices[i].mac) + "</div>";
    list += "</div>";
    list += "<div class='device-actions'>";
    list += "<button class='btn btn-wake' onclick='wakeDevice(" + String(i) + ")'>唤醒</button>";
    list += "<button class='btn btn-delete' onclick='deleteDevice(" + String(i) + ")'>删除</button>";
    list += "</div>";
    list += "</li>";
  }
  return list;
}

// ==================== WebSocket 客户端 ====================
void setupWsClient() {
  // 销毁旧实例，创建全新客户端（避免 SSL 状态残留）
  if (wsClient) {
    wsClient->close();
    delete wsClient;
  }
  wsClient = new WebsocketsClient();
  wsClient->setInsecure();

  wsClient->onMessage(onWsMessage);
  wsClient->onEvent([](WebsocketsEvent event, String data) {
    if (event == WebsocketsEvent::ConnectionOpened) {
      Serial.println("WebSocket 已连接");
      wsConnecting = false;
      JsonDocument auth;
      auth["type"] = "auth";
      auth["device_id"] = "esp32-wol";
      auth["user"] = WS_USER;
      auth["pass"] = WS_PASS;
      auth["token"] = WS_TOKEN;
      String authStr;
      serializeJson(auth, authStr);
      wsClient->send(authStr);
    } else if (event == WebsocketsEvent::ConnectionClosed) {
      Serial.println("WebSocket 已断开");
      wsConnecting = false;
    }
  });
}

void initWebSocket() {
  if (WS_SERVER.isEmpty()) {
    Serial.println("WebSocket 服务器地址未配置");
    return;
  }

  setupWsClient();
  connectWebSocket();
}

void connectWebSocket() {
  if (WS_SERVER.isEmpty() || wsConnecting) return;

  // 确保 WiFi 已连接
  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("WiFi 未连接，跳过 WebSocket 连接");
    return;
  }

  wsConnecting = true;
  Serial.printf("连接 WebSocket: %s\n", WS_SERVER.c_str());
  Serial.printf("可用堆内存: %d bytes\n", ESP.getFreeHeap());

  // 每次重连前重建客户端实例
  setupWsClient();

  bool connected = false;
  for (int i = 0; i < 3; i++) {
    connected = wsClient->connect(WS_SERVER);
    if (connected) break;
    Serial.printf("连接尝试 %d 失败，重试...\n", i + 1);
    delay(1000);
  }

  if (connected) {
    Serial.println("WebSocket 连接成功");
  } else {
    Serial.println("WebSocket 连接失败");
    wsConnecting = false;
  }
  lastWsReconnect = millis();
}

void handleWebSocket() {
  static unsigned long lastPoll = 0;

  // WiFi 未连接时跳过
  if (WiFi.status() != WL_CONNECTED) return;

  // 轮询 WebSocket 消息
  if (wsClient && millis() - lastPoll > 50) {
    wsClient->poll();
    lastPoll = millis();
  }

  // 断线重连
  if ((!wsClient || !wsClient->available()) && !wsConnecting && millis() - lastWsReconnect > 10000) {
    Serial.println("WebSocket 重连中...");
    connectWebSocket();
  }

  // 心跳保活
  if (wsClient && wsClient->available() && millis() - lastWsHeartbeat > 30000) {
    JsonDocument ping;
    ping["type"] = "ping";
    String pingStr;
    serializeJson(ping, pingStr);
    wsClient->send(pingStr);
    lastWsHeartbeat = millis();
  }
}

void onWsMessage(WebsocketsMessage message) {
  Serial.printf("WS 收到: %s\n", message.data().c_str());

  JsonDocument doc;
  DeserializationError err = deserializeJson(doc, message.data());
  if (err) {
    Serial.println("JSON 解析失败");
    return;
  }

  String response = handleWsCommand(doc);
  if (response.length() > 0) {
    wsClient->send(response);
  }
}

String handleWsCommand(JsonDocument& doc) {
  String cmd = doc["cmd"] | "";
  String requestId = doc["request_id"] | "";

  JsonDocument resp;
  resp["request_id"] = requestId;

  if (cmd == "ping") {
    resp["cmd"] = "pong";
    resp["success"] = true;
  }
  else if (cmd == "get_devices") {
    resp["cmd"] = "devices";
    resp["success"] = true;
    JsonArray arr = resp["data"].to<JsonArray>();
    for (int i = 0; i < deviceCount; i++) {
      JsonObject d = arr.add<JsonObject>();
      d["index"] = i;
      d["name"] = devices[i].name;
      d["mac"] = macToString(devices[i].mac);
      d["enabled"] = devices[i].enabled;
    }
  }
  else if (cmd == "wake") {
    int index = doc["index"] | -1;
    if (index >= 0 && index < deviceCount) {
      sendWOL(devices[index].mac);
      resp["cmd"] = "wake_result";
      resp["success"] = true;
      resp["data"]["device"] = devices[index].name;
      resp["data"]["mac"] = macToString(devices[index].mac);
    } else if (doc["all"] == true) {
      for (int i = 0; i < deviceCount; i++) {
        sendWOL(devices[i].mac);
        delay(50);
      }
      resp["cmd"] = "wake_result";
      resp["success"] = true;
      resp["data"]["device"] = "all";
    } else {
      resp["cmd"] = "wake_result";
      resp["success"] = false;
      resp["message"] = "无效索引";
    }
  }
  else if (cmd == "wake_broadcast") {
    // 广播唤醒整个局域网
    Serial.println("WS 广播唤醒");

    IPAddress broadcastIP(255, 255, 255, 255);
    IPAddress subnetBroadcast = WiFi.localIP();
    subnetBroadcast[3] = 255;

    int sentCount = 0;

    // 唤醒已保存设备
    for (int i = 0; i < deviceCount; i++) {
      sendWOL(devices[i].mac);
      sentCount++;
      delay(50);
    }

