MatrixSeven/esp32-wol-online/src/main.cpp
    // 发送广播包
    uint8_t packet[102];
    for (int i = 0; i < 6; i++) packet[i] = 0xFF;
    for (int i = 1; i <= 16; i++)
      for (int j = 0; j < 6; j++)
        packet[i * 6 + j] = 0xFF;

    for (int retry = 0; retry < 5; retry++) {
      udp.beginPacket(broadcastIP, WOL_PORT);
      udp.write(packet, 102);
      udp.endPacket();
      udp.beginPacket(subnetBroadcast, WOL_PORT);
      udp.write(packet, 102);
      udp.endPacket();
      delay(100);
      sentCount += 2;
    }

    // 唤醒扫描到的设备
    for (int i = 0; i < scannedDeviceCount; i++) {
      if (scannedDevices[i].mac[0] == 0 && scannedDevices[i].mac[1] == 0) continue;
      sendWOL(scannedDevices[i].mac);
      sentCount++;
      delay(30);
    }

    resp["cmd"] = "wake_result";
    resp["success"] = true;
    resp["data"]["device"] = "broadcast";
    resp["data"]["count"] = sentCount;
    Serial.printf("广播唤醒完成, 发送 %d 个包\n", sentCount);
  }
  else if (cmd == "add_device") {
    String name = doc["name"] | "";
    String mac = doc["mac"] | "";
    if (name.isEmpty() || mac.isEmpty()) {
      resp["cmd"] = "add_result";
      resp["success"] = false;
      resp["message"] = "参数不完整";
    } else if (deviceCount >= MAX_DEVICES) {
      resp["cmd"] = "add_result";
      resp["success"] = false;
      resp["message"] = "设备数量已达上限";
    } else {
      devices[deviceCount].name = name;
      parseMac(mac, devices[deviceCount].mac);
      devices[deviceCount].enabled = true;
      deviceCount++;
      saveDevices();
      resp["cmd"] = "add_result";
      resp["success"] = true;
      resp["data"]["index"] = deviceCount - 1;
      resp["data"]["name"] = name;
      resp["data"]["mac"] = mac;
      Serial.printf("WS 添加设备: %s [%s]\n", name.c_str(), mac.c_str());
    }
  }
  else if (cmd == "delete_device") {
    int index = doc["index"] | -1;
    if (index >= 0 && index < deviceCount) {
      Serial.printf("WS 删除设备: %s\n", devices[index].name.c_str());
      for (int i = index; i < deviceCount - 1; i++) {
        devices[i] = devices[i + 1];
      }
      deviceCount--;
      saveDevices();
      resp["cmd"] = "delete_result";
      resp["success"] = true;
    } else {
      resp["cmd"] = "delete_result";
      resp["success"] = false;
      resp["message"] = "无效索引";
    }
  }
  else if (cmd == "scan") {
    if (isScanning) {
      resp["cmd"] = "scan_result";
      resp["success"] = false;
      resp["message"] = "扫描进行中";
    } else {
      resp["cmd"] = "scan_started";
      resp["success"] = true;
      String respStr;
      serializeJson(resp, respStr);
      wsClient->send(respStr);

      // 异步扫描
      startNetworkScan();

      // 返回扫描结果
      resp.clear();
      resp["request_id"] = requestId;
      resp["cmd"] = "scan_result";
      resp["success"] = true;
      resp["data"]["progress"] = 100;
      JsonArray arr = resp["data"]["devices"].to<JsonArray>();
      for (int i = 0; i < scannedDeviceCount; i++) {
        JsonObject d = arr.add<JsonObject>();
        d["ip"] = scannedDevices[i].ip.toString();
        d["mac"] = macToString(scannedDevices[i].mac);
      }
    }
  }
  else if (cmd == "get_scan_status") {
    // 返回当前扫描状态
    resp["cmd"] = "scan_status";
    resp["success"] = true;
    resp["data"]["scanning"] = isScanning;
    resp["data"]["progress"] = scanProgress;
    JsonArray arr = resp["data"]["devices"].to<JsonArray>();
    for (int i = 0; i < scannedDeviceCount; i++) {
      JsonObject d = arr.add<JsonObject>();
      d["ip"] = scannedDevices[i].ip.toString();
      d["mac"] = macToString(scannedDevices[i].mac);
      d["name"] = scannedDevices[i].hostname;
    }
  }
  else if (cmd == "get_status") {
    // 读取芯片内部温度 (ESP32-S3)
    float tempC = temperatureRead();
    resp["cmd"] = "status";
    resp["success"] = true;
    resp["data"]["ip"] = WiFi.localIP().toString();
    resp["data"]["mac"] = WiFi.macAddress();
    resp["data"]["ssid"] = String(WIFI_SSID);
    resp["data"]["wifi_rssi"] = WiFi.RSSI();
    resp["data"]["device_count"] = deviceCount;
    resp["data"]["wake_count"] = wakeCount;
    resp["data"]["uptime"] = millis() / 1000;
    resp["data"]["free_heap"] = ESP.getFreeHeap();
    resp["data"]["temperature"] = tempC;
    resp["data"]["chip_model"] = ESP.getChipModel();
    resp["data"]["flash_size"] = ESP.getFlashChipSize();
    resp["data"]["sdk_version"] = ESP.getSdkVersion();
  }
  else {
    resp["cmd"] = "error";
    resp["success"] = false;
    resp["message"] = "未知命令: " + cmd;
  }

  String respStr;
  serializeJson(resp, respStr);
  return respStr;
}

void updateWsStatus() {
  // 用于前端状态更新，可通过 WebSocket 广播
}
